tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Core application library for C
brew "glib"
# SSL/TLS cryptography library
brew "openssl"
# Shell extension to jump to frequently used directories
brew "autojump"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Text processing scripting language
brew "awk"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 4.1+
brew "bash-completion@2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Fish completion for brew-cask
brew "brew-cask-completion"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# Dependency Manager for PHP
brew "composer"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Command-line JavaScript / TypeScript engine
brew "deno"
# Minimal, fast alternative to 'du -sh'
brew "diskus"
# More intuitive version of du in rust
brew "dust"
# Modern replacement for 'ls'
brew "exa"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Generic library support script
brew "libtool"
# Gatsby command-line interface
brew "gatsby-cli"
# GNU compiler collection
brew "gcc"
# Google Drive CLI Client
brew "gdrive"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Alternative to top/htop
brew "glances"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# GNU grep, egrep and fgrep
brew "grep"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just"
# Mac App Store command-line interface
brew "mas"
# Command-line client for Mega.co.nz
brew "megatools"
# Open source relational database management system
brew "mysql", restart_service: true
# Node version management
brew "n"
# Fast, highly customisable system info script
brew "neofetch"
# Modern shell for the GitHub era
brew "nushell"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Command-line tool to generate, analyze, convert and manipulate colors
brew "pastel"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Parse HTML at the command-line
brew "pup"
# Cross-platform application and UI framework
brew "qt"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# The cross-shell prompt for astronauts
brew "starship"
# Manipulate and query tags on macOS files
brew "tag"
# Internet file retriever
brew "wget"
# Command-line interface for WordPress
brew "wp-cli"
# Bash completion for Wpcli
brew "wp-cli-completion"
# Download YouTube videos from the command-line
brew "youtube-dl"
cask "alfred"
cask "adobe-acrobat-reader"
cask "authy"
cask "bitwarden"
cask "carbon-copy-cloner"
cask "cleanmymac"
cask "cloudmounter"
cask "controlplane"
cask "crossover"
cask "cyberduck"
cask "dhs"
cask "discord"
cask "dolphin"
cask "easyfind"
cask "firefox"
cask "fl-studio"
cask "flash-player"
cask "font-open-sans"
cask "font-raleway"
cask "gemini"
cask "google-drive-file-stream"
cask "grandperspective"
cask "handbrake"
cask "hex-fiend"
cask "iina"
cask "imageoptim"
cask "integrity"
cask "java"
cask "java8"
cask "jdownloader"
cask "keybase"
cask "knockknock"
cask "lackeyccg"
cask "launchrocket"
cask "loopback"
cask "lulu"
cask "malwarebytes"
cask "megasync"
cask "navicat-premium"
cask "microsoft-edge"
cask "obs"
cask "openemu"
cask "paparazzi"
cask "paste"
cask "paw"
cask "parallels"
cask "plex"
cask "protonvpn"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlvideo"
cask "quicklook-json"
cask "ransomwhere"
cask "steam"
cask "sublime-merge"
cask "sublime-text"
cask "suspicious-package"
cask "teamviewer"
cask "the-unarchiver"
cask "vlc"
cask "webtorrent"
cask "xmind-zen"
cask "yacreader"
cask "zoomus"
mas "GIF Brewery 3", id: 1081413713
mas "Gifski", id: 1351639930
mas "Microsoft Excel", id: 462058435
mas "Microsoft Remote Desktop", id: 1295203466
mas "PiPer", id: 1421915518
mas "Microsoft Word", id: 462054704
mas "Xcode", id: 497799835
